---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpaceAssocRoomNumber
source: html/7c5042ce-1d3a-a9b8-991f-6503ab0ceb64.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpaceAssocRoomNumber Property

"Room Number"

## Syntax (C#)
```csharp
public static ForgeTypeId SpaceAssocRoomNumber { get; }
```